### Terraform Plan Output Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.bastion will be created
  + resource "azurerm_resource_group" "bastion" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rsi-bastion-dev-rg"
    }

  # azurerm_virtual_network_peering.rsi-be-to-fe will be created
  + resource "azurerm_virtual_network_peering" "rsi-be-to-fe" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "beTofe"
      + remote_virtual_network_id    = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet"
      + resource_group_name          = "rsi-dev-rg"
      + triggers                     = {
          + "remote_address_space" = "10.0.0.0/16"
        }
      + use_remote_gateways          = false
      + virtual_network_name         = "rsi-be-vnet"
    }

  # azurerm_virtual_network_peering.rsi-fe-to-be will be created
  + resource "azurerm_virtual_network_peering" "rsi-fe-to-be" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "feTobe"
      + remote_virtual_network_id    = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-be-vnet"
      + resource_group_name          = "rsi-dev-rg"
      + triggers                     = {
          + "remote_address_space" = "10.1.0.0/16"
        }
      + use_remote_gateways          = false
      + virtual_network_name         = "rsi-fe-vnet"
    }

  # module.bastion.azurerm_bastion_host.this will be created
  + resource "azurerm_bastion_host" "this" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "uksouth"
      + name                   = "rsi-bast"
      + resource_group_name    = "rsi-bastion-dev-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tags                   = {
          + "Component"   = "Access"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "bastion_ip_config"
          + public_ip_address_id = (known after apply)
          + subnet_id            = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public"
        }
    }

  # module.bastion.azurerm_network_security_group.this will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "rsi-bastion-nsg"
      + resource_group_name = "rsi-bastion-dev-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAzureLoadBalancerInbound"
              + priority                                   = 140
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowGatewayManagerInbound"
              + priority                                   = 130
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "GatewayManager"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHttpsInbound"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "AzureCloud"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowAzureCloudOutbound"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "Internet"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowGetSessionInformation"
              + priority                                   = 130
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "22",
                  + "3389",
                ]
              + direction                                  = "Outbound"
              + name                                       = "AllowSshRdpOutbound"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "5701",
                  + "8080",
                ]
              + direction                                  = "Inbound"
              + name                                       = "AllowBastionHostCommunication"
              + priority                                   = 150
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "5701",
                  + "8080",
                ]
              + direction                                  = "Outbound"
              + name                                       = "AllowBastionCommunication"
              + priority                                   = 120
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "bastion-in-deny"
              + priority                                   = 900
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Component"   = "Access"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.bastion.azurerm_public_ip.this will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "rsi-bastion-pip"
      + resource_group_name     = "rsi-bastion-dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Component"   = "Access"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.bastion.azurerm_subnet_network_security_group_association.this will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/public"
    }

  # module.fe-loadbalancer.data.azurerm_resource_group.azlb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "azlb" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-dev-rg"
      + tags       = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb.azlb will be created
  + resource "azurerm_lb" "azlb" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "fe-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rsi-dev-rg"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "myPublicIP"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.0.1.10"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.fe-loadbalancer.azurerm_lb_backend_address_pool.azlb will be created
  + resource "azurerm_lb_backend_address_pool" "azlb" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "BackEndAddressPool"
      + outbound_rules            = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb_probe.azlb[0] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "http"
      + number_of_probes    = 2
      + port                = 80
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[0] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "myPublicIP"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "http"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[1] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "myPublicIP"
      + frontend_port                  = 443
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "https"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.rsi-vnet-fe.azurerm_subnet.subnet_for_each["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "subnet_for_each" {
      + address_prefixes                               = [
          + "10.0.3.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rsi-dev-rg"
      + virtual_network_name                           = "rsi-fe-vnet"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

  ```
  </details>
  
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*